espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/wiseconnect-wifi-bt-sdk/examples/snippets/wlan_bt_ble/wlan_https_bt_a2dp/platforms/nxp/rt595/devices/MIMXRT595S/drivers/fsl_casper.c
#define add_cout(carry, c, a, b) add(carry, c, a, b)

#define add_cout_cin(carryout, c, a, b, carryin) \
    do                                           \
    {                                            \
        uint64_t _t = (uint64_t)a + b + carryin; \
        c = (uint32_t)_t;                        \
        carryout = (uint32_t)(_t >> 32);         \
    } while (0)

#define sub_borrowout(borrow, c, a, b) \
    do                                 \
    {                                  \
        uint32_t _b = (b > a);         \
        c = a - b;                     \
        borrow = _b;                   \
    } while (0)

#define sub_borrowin_borrowout(borrowout, c, a, b, borrowin) \
    do                                                       \
    {                                                        \
        uint32_t _t, _borrow1, _borrow2;                     \
        sub_borrowout(_borrow1, _t, a, b);                   \
        sub_borrowout(_borrow2, c, _t, borrowin);            \
        borrowout = _borrow1 + _borrow2;                     \
    } while (0)

#define sub_borrowout_1(borrow, c, a) \
    do                                \
    {                                 \
        uint32_t _b = 0;              \
        c = a - b;                    \
        borrow = _b;                  \
    } while (0)

#define sub_borrowin_borrowout_1(borrowout, c, a, borrowin) \
    do                                                      \
    {                                                       \
        uint32_t _t, _borrow1, _borrow2;                    \
        sub_borrowout_1(_borrow1, _t, a);                   \
        sub_borrowout(_borrow2, c, _t, borrowin);           \
        borrowout = _borrow1 + _borrow2;                    \
    } while (0)

/* 32 x 32 --> 64-bit multiplication
* (c1,c0) = a * b
*/
#define mul(c1, c0, a, b)                     \
    \
do                                     \
    {                                         \
        uint64_t __m;                         \
        __m = (uint64_t)a * (uint64_t)b;      \
        c0 = (uint32_t)__m;                   \
        c1 = (uint32_t)(__m >> (uint64_t)32); \
    \
}                                      \
    while (0)

/* Multiply-and-accumulate
* (c1,c0) = a*b+c0
 */
#define muladd(c1, c0, a, b)   \
    \
do                      \
    {                          \
        uint32_t __ma = c0;    \
        mul(c1, c0, a, b);     \
        c0 = c0 + __ma;        \
        c1 = c1 + (c0 < __ma); \
    \
}                       \
    while (0)

/* Multiply-and-accumulate-accumulate
* (c1,c0) = a*b+c0+c1
*/
#define muladdadd(c1, c0, a, b)            \
    \
do                                  \
    {                                      \
        uint32_t __maa0 = c0, __maa1 = c1; \
        mul(c1, c0, a, b);                 \
        c0 = c0 + __maa0;                  \
        c1 = c1 + (c0 < __maa0);           \
        c0 = c0 + __maa1;                  \
        c1 = c1 + (c0 < __maa1);           \
    \
}                                   \
    while (0)

#if CASPER_ECC_P256

/* Recoding length for the secure scalar multiplication:
*  Use n=256 and w=4 --> compute ciel(384/3) = 86 + 1 digits
*/
#define CASPER_RECODE_LENGTH 87
#define invert(c, a) invert_mod_p256(c, a)
#define ONE NISTr256

/* Shift right by 1 <= c <= 31. z[] and x[] in system RAM, no interleaving macros used. */
#define shiftrightSysram(z, x, c)                    \
    do                                               \
    {                                                \
        z[0] = (x[1] << (32 - (c))) | (x[0] >> (c)); \
        z[1] = (x[2] << (32 - (c))) | (x[1] >> (c)); \
        z[2] = (x[3] << (32 - (c))) | (x[2] >> (c)); \
        z[3] = (x[4] << (32 - (c))) | (x[3] >> (c)); \
        z[4] = (x[5] << (32 - (c))) | (x[4] >> (c)); \
        z[5] = (x[6] << (32 - (c))) | (x[5] >> (c)); \
        z[6] = (x[7] << (32 - (c))) | (x[6] >> (c)); \
        z[7] = (x[7] >> (c));                        \
    } while (0)

#elif CASPER_ECC_P384

/* Recoding length for the secure scalar multiplication:
 *  Use n=384 and w=4 --> compute ciel(384/3) = 128 + 1 digits
 */
#define CASPER_RECODE_LENGTH 129
#define invert(c, a) invert_mod_p384(c, a)
#define ONE NISTr384

/* Shift right by 1 <= c <= 31.  z[] and x[] in system RAM, no interleaving macros used. */
#define shiftrightSysram(z, x, c)                       \
    do                                                  \
    {                                                   \
        z[0] = (x[1] << (32 - (c))) | (x[0] >> (c));    \
        z[1] = (x[2] << (32 - (c))) | (x[1] >> (c));    \
        z[2] = (x[3] << (32 - (c))) | (x[2] >> (c));    \
        z[3] = (x[4] << (32 - (c))) | (x[3] >> (c));    \
        z[4] = (x[5] << (32 - (c))) | (x[4] >> (c));    \
        z[5] = (x[6] << (32 - (c))) | (x[5] >> (c));    \
        z[6] = (x[7] << (32 - (c))) | (x[6] >> (c));    \
        z[7] = (x[8] << (32 - (c))) | (x[7] >> (c));    \
        z[8] = (x[9] << (32 - (c))) | (x[8] >> (c));    \
        z[9] = (x[10] << (32 - (c))) | (x[9] >> (c));   \
        z[10] = (x[11] << (32 - (c))) | (x[10] >> (c)); \
        z[11] = (x[11] >> (c));                         \
    } while (0)

#else
#error "Define proper NIST curve"
#endif

#define multiply_casper(c, a, b) MultprecCiosMul_ct(c, a, b, &CASPER_MEM[MOD_SCRATCH_START], Np)
#define square_casper(c, a) multiply_casper(c, a, a)
#define sub_casper(c, a, b) CASPER_montsub(c, a, b, &CASPER_MEM[MOD_SCRATCH_START])
#define add_casper(c, a, b) CASPER_montadd(c, a, b, &CASPER_MEM[MOD_SCRATCH_START])
#define mul2_casper(c, a) add_casper(c, a, a)
#define half(c, a, b) CASPER_half(c, a, b)
#define copy(c, a) CASPER_MEMCPY(c, a, NUM_LIMBS * sizeof(uint32_t))

/*******************************************************************************
 * Variables
 ******************************************************************************/

