espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/wiseconnect-wifi-bt-sdk/examples/snippets/wlan_bt_ble/wlan_https_bt_a2dp/platforms/nxp/rt595/devices/MIMXRT595S/drivers/fsl_casper.c
#define GET_LUT(x, y, z, index)                       \
    do                                                \
    {                                                 \
        int m;                                        \
        copy(x, LUT(1, 0));                           \
        copy(y, LUT(1, 1));                           \
        copy(z, LUT(1, 2));                           \
        m = (index == 3);                             \
        casper_select(x, x, LUT(3, 0), m, NUM_LIMBS); \
        casper_select(y, y, LUT(3, 1), m, NUM_LIMBS); \
        casper_select(z, z, LUT(3, 2), m, NUM_LIMBS); \
        m = (index == 5);                             \
        casper_select(x, x, LUT(5, 0), m, NUM_LIMBS); \
        casper_select(y, y, LUT(5, 1), m, NUM_LIMBS); \
        casper_select(z, z, LUT(5, 2), m, NUM_LIMBS); \
        m = (index == 7);                             \
        casper_select(x, x, LUT(7, 0), m, NUM_LIMBS); \
        casper_select(y, y, LUT(7, 1), m, NUM_LIMBS); \
        casper_select(z, z, LUT(7, 2), m, NUM_LIMBS); \
    } while (0)

    GET_LUT(X3, Y3, Z3, index);

    /* Compute -y and select the positive or negative point. */
    sub_n(M, p, Y3, NUM_LIMBS); // todo!!!
    casper_select(Y3, Y3, M, sign, NUM_LIMBS);

    for (i = CASPER_RECODE_LENGTH - 2; i >= 0; i--)
    {
        Jac_double(X3, Y3, Z3, X3, Y3, Z3);
        Jac_double(X3, Y3, Z3, X3, Y3, Z3);
        Jac_double(X3, Y3, Z3, X3, Y3, Z3);

        index = int8abs(rec[i]);
        sign = ((uint8_t)rec[i]) >> 7;

        GET_LUT(X, Y, Z, index);

        /* Compute -y and select the positive or negative point. */
        sub_n(scalar, p, Y, NUM_LIMBS); // todo!!!
        casper_select(scalar, Y, scalar, sign, NUM_LIMBS);

        Jac_addition(X3, Y3, Z3, X3, Y3, Z3, X, scalar, Z);
    }

    sub_n(M, p, Y3, NUM_LIMBS); // todo!!!

    casper_select(Y3, M, Y3, odd, NUM_LIMBS);
}

#undef LUT
#undef GET_LUT

/*
 * Pre-compute the following 16 points:
 * 00 00 = 0*P + 0*Q  <-- Not needed when using sliding windows
 * 00 01 = 0*P + 1*Q  <-- Not needed when using sliding windows
 * 00 10 = 0*P + 2*Q
 * 00 11 = 0*P + 3*Q
 *
 * 01 00 = 1*P + 0*Q  <-- Not needed when using sliding windows
 * 01 01 = 1*P + 1*Q  <-- Not needed when using sliding windows
 * 01 10 = 1*P + 2*Q
 * 01 11 = 1*P + 3*Q
 *
 * 10 00 = 2*P + 0*Q
 * 10 01 = 2*P + 1*Q
 * 10 10 = 2*P + 2*Q
 * 10 11 = 2*P + 3*Q
 *
 * 11 00 = 3*P + 0*Q
 * 11 01 = 3*P + 1*Q
 * 11 10 = 3*P + 2*Q
 * 11 11 = 3*P + 3*Q
 *
 * index = (bitsi||bitsj)-2 - (biti != 0)*2
 *
 * Input:   P = (X1 : Y1 : Z1) and
 *          Q = (X2 : Y2 : Z2)
 * Output: mem, memory location for the LUT.
 */

#define LUT_LIMBS NUM_LIMBS

static void precompute_double_scalar_LUT(uint32_t *Px, uint32_t *Py, uint32_t *Qx, uint32_t *Qy)
{
    uint32_t *Q2x, *Q2y, *Q2z, *P2x, *P2y, *P2z, *Z, *mem;
    int index = 0;

    Q2x = &CASPER_MEM[LUT_SCRATCH_START + 48 * LUT_LIMBS + 0 * CASPER_NUM_LIMBS];
    Q2y = &CASPER_MEM[LUT_SCRATCH_START + 48 * LUT_LIMBS + 1 * CASPER_NUM_LIMBS];
    Q2z = &CASPER_MEM[LUT_SCRATCH_START + 48 * LUT_LIMBS + 2 * CASPER_NUM_LIMBS];

    /* Re-use memory from different scratch space since no
    * projective point addition is used below. */
    P2x = &CASPER_MEM[ECC_SCRATCH_START + 5 * CASPER_NUM_LIMBS];
    P2z = &CASPER_MEM[ECC_SCRATCH_START + 6 * CASPER_NUM_LIMBS];
    P2y = &CASPER_MEM[ECC_SCRATCH_START + 7 * CASPER_NUM_LIMBS];
    Z = &CASPER_MEM[ECC_SCRATCH_START + 8 * CASPER_NUM_LIMBS];

    mem = &CASPER_MEM[LUT_SCRATCH_START];

    copy(Z, ONE);

    // 00 10 = 0*P + 2*Q
    Jac_double(Q2x, Q2y, Q2z, Qx, Qy, Z);
    copy(&mem[index], Q2x);
    index += LUT_LIMBS;
    copy(&mem[index], Q2y);
    index += LUT_LIMBS;
    copy(&mem[index], Q2z);
    index += LUT_LIMBS;

    // 00 11 = 0*P + 3*Q
    Jac_add_affine(P2x, P2y, P2z, Q2x, Q2y, Q2z, Qx, Qy);
    copy(&mem[index], P2x);
    index += LUT_LIMBS;
    copy(&mem[index], P2y);
    index += LUT_LIMBS;
    copy(&mem[index], P2z);
    index += LUT_LIMBS;

    // 01 10 = 1*P + 2*Q
    Jac_add_affine(P2x, P2y, P2z, Q2x, Q2y, Q2z, Px, Py);
    copy(&mem[index], P2x);
    index += LUT_LIMBS;
    copy(&mem[index], P2y);
    index += LUT_LIMBS;
    copy(&mem[index], P2z);
    index += LUT_LIMBS;

    // 01 11 = 1*P + 3*Q
    Jac_add_affine(P2x, P2y, P2z, P2x, P2y, P2z, Qx, Qy);
    copy(&mem[index], P2x);
    index += LUT_LIMBS;
    copy(&mem[index], P2y);
    index += LUT_LIMBS;
    copy(&mem[index], P2z);
    index += LUT_LIMBS;

    // 10 00 = 2*P + 0*Q
    Jac_double(P2x, P2y, P2z, Px, Py, Z);
    copy(&mem[index], P2x);
    index += LUT_LIMBS;
    copy(&mem[index], P2y);
    index += LUT_LIMBS;
    copy(&mem[index], P2z);
    index += LUT_LIMBS;

    // 10 01 = 2*P + 1*Q
    Jac_add_affine(Q2x, Q2y, Q2z, P2x, P2y, P2z, Qx, Qy);
    copy(&mem[index], Q2x);
    index += LUT_LIMBS;
    copy(&mem[index], Q2y);
    index += LUT_LIMBS;
    copy(&mem[index], Q2z);
    index += LUT_LIMBS;

    // 10 10 = 2*P + 2*Q
    Jac_add_affine(Q2x, Q2y, Q2z, Q2x, Q2y, Q2z, Qx, Qy);
    copy(&mem[index], Q2x);
    index += LUT_LIMBS;
    copy(&mem[index], Q2y);
    index += LUT_LIMBS;
    copy(&mem[index], Q2z);
    index += LUT_LIMBS;

    // 10 11 = 2*P + 3*Q
    Jac_add_affine(Q2x, Q2y, Q2z, Q2x, Q2y, Q2z, Qx, Qy);
    copy(&mem[index], Q2x);
    index += LUT_LIMBS;
    copy(&mem[index], Q2y);
    index += LUT_LIMBS;
    copy(&mem[index], Q2z);
    index += LUT_LIMBS;

    // 11 00 = 3*P + 0*Q
    Jac_add_affine(P2x, P2y, P2z, P2x, P2y, P2z, Px, Py);
    copy(&mem[index], P2x);
    index += LUT_LIMBS;
    copy(&mem[index], P2y);
    index += LUT_LIMBS;
    copy(&mem[index], P2z);
    index += LUT_LIMBS;

    // 11 01 = 3*P + 1*Q
    Jac_add_affine(Q2x, Q2y, Q2z, P2x, P2y, P2z, Qx, Qy);
    copy(&mem[index], Q2x);
    index += LUT_LIMBS;
    copy(&mem[index], Q2y);
    index += LUT_LIMBS;
    copy(&mem[index], Q2z);
    index += LUT_LIMBS;

