espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/wiseconnect-wifi-bt-sdk/examples/snippets/wlan_bt_ble/wlan_https_bt_a2dp/platforms/nxp/rt595/devices/MIMXRT595S/drivers/fsl_casper.c
    // 11 10 = 3*P + 2*Q
    Jac_add_affine(Q2x, Q2y, Q2z, Q2x, Q2y, Q2z, Qx, Qy);
    copy(&mem[index], Q2x);
    index += LUT_LIMBS;
    copy(&mem[index], Q2y);
    index += LUT_LIMBS;
    copy(&mem[index], Q2z);
    index += LUT_LIMBS;

    // 11 11 = 3*P + 3*Q
    Jac_add_affine(Q2x, Q2y, Q2z, Q2x, Q2y, Q2z, Qx, Qy);
    copy(&mem[index], Q2x);
    index += LUT_LIMBS;
    copy(&mem[index], Q2y);
    index += LUT_LIMBS;
    copy(&mem[index], Q2z);
    index += LUT_LIMBS;
}

#define GETLUTX(x) (3 * (x)*LUT_LIMBS)
#define GETLUTY(x) (3 * (x)*LUT_LIMBS + 1 * LUT_LIMBS)
#define GETLUTZ(x) (3 * (x)*LUT_LIMBS + 2 * LUT_LIMBS)

/* Compute the double scalar multiplication
 * (X3 : Y3 : Z3) = k1 * (X1, Y1) + k2 * (X2, Y2)
 * Using Shamir's trick and precomputing 16 points.
 * This code is *not* constant time since this is used
 * for verification only.
 */
void double_scalar_multiplication(uint32_t *X3,
                                  uint32_t *Y3,
                                  uint32_t *Z3,
                                  uint32_t *X1,
                                  uint32_t *Y1,
                                  uint32_t *k1,
                                  uint32_t *X2,
                                  uint32_t *Y2,
                                  uint32_t *k2)
{
    uint32_t index, c = 0;
    uint32_t *p1, *p2, x1, x2, *lut, *Tx, *Ty, *Tz;

    precompute_double_scalar_LUT(X1, Y1, X2, Y2);

    lut = &CASPER_MEM[LUT_SCRATCH_START];
    p1 = &CASPER_MEM[LUT_SCRATCH_START + 48 * LUT_LIMBS];
    p2 = &CASPER_MEM[LUT_SCRATCH_START + 48 * LUT_LIMBS + 1 * CASPER_NUM_LIMBS];

    Tx = &CASPER_MEM[LUT_SCRATCH_START + 48 * LUT_LIMBS + 2 * CASPER_NUM_LIMBS];
    Ty = &CASPER_MEM[LUT_SCRATCH_START + 48 * LUT_LIMBS + 3 * CASPER_NUM_LIMBS];
    Tz = &CASPER_MEM[LUT_SCRATCH_START + 48 * LUT_LIMBS + 4 * CASPER_NUM_LIMBS];

    CASPER_MEMCPY(p1, k1, sizeof(uint32_t) * NUM_LIMBS);
    CASPER_MEMCPY(p2, k2, sizeof(uint32_t) * NUM_LIMBS);

    /* Check if we can slide. */
    while (((casper_get_word(&p1[NUM_LIMBS - 1]) | casper_get_word(&p2[NUM_LIMBS - 1])) >> 31) == 0 && c < 256)
    {
        shiftleft(p1, p1, 1);
        shiftleft(p2, p2, 1);
        c++;
        /* No doubling needed. */
    }

    /* Set the first value. */
    x1 = casper_get_word(&p1[NUM_LIMBS - 1]) >> 30;
    x2 = casper_get_word(&p2[NUM_LIMBS - 1]) >> 30;
    index = (x2 | (x1 << 2)) - 2 - (x1 != 0) * 2;
    shiftleft(p1, p1, 2);
    shiftleft(p2, p2, 2);

    copy(X3, &lut[GETLUTX(index)]);
    copy(Y3, &lut[GETLUTY(index)]);
    copy(Z3, &lut[GETLUTZ(index)]);
    c += 2;

// todo: create an is_zero function
#if CASPER_ECC_P256
    while ((casper_get_word(&p1[0]) | casper_get_word(&p1[1]) | casper_get_word(&p1[2]) | casper_get_word(&p1[3]) |
            casper_get_word(&p1[4]) | casper_get_word(&p1[5]) | casper_get_word(&p1[6]) | casper_get_word(&p1[7]) |
            casper_get_word(&p2[0]) | casper_get_word(&p2[1]) | casper_get_word(&p2[2]) | casper_get_word(&p2[3]) |
            casper_get_word(&p2[4]) | casper_get_word(&p2[5]) | casper_get_word(&p2[6]) | casper_get_word(&p2[7])) != 0)
    {
#elif CASPER_ECC_P384
    while ((casper_get_word(&p1[0]) | casper_get_word(&p1[1]) | casper_get_word(&p1[2]) | casper_get_word(&p1[3]) |
            casper_get_word(&p1[4]) | casper_get_word(&p1[5]) | casper_get_word(&p1[6]) | casper_get_word(&p1[7]) |
            casper_get_word(&p1[8]) | casper_get_word(&p1[9]) | casper_get_word(&p1[10]) | casper_get_word(&p1[11]) |
            casper_get_word(&p2[0]) | casper_get_word(&p2[1]) | casper_get_word(&p2[2]) | casper_get_word(&p2[3]) |
            casper_get_word(&p2[4]) | casper_get_word(&p2[5]) | casper_get_word(&p2[6]) | casper_get_word(&p2[7]) |
            casper_get_word(&p2[8]) | casper_get_word(&p2[9]) | casper_get_word(&p2[10]) | casper_get_word(&p2[11])) !=
           0)
    {
#endif
        /* Check if we can slide. */
        while (((casper_get_word(&p1[NUM_LIMBS - 1]) | casper_get_word(&p2[NUM_LIMBS - 1])) >> 31) == 0 && c < N_bitlen)
        {
            shiftleft(p1, p1, 1);
            shiftleft(p2, p2, 1);
            Jac_double(X3, Y3, Z3, X3, Y3, Z3);
            c++;
        }

        if (c >= (N_bitlen - 1))
            break;

        /* Double twice. */
        Jac_double(X3, Y3, Z3, X3, Y3, Z3);
        Jac_double(X3, Y3, Z3, X3, Y3, Z3);

        /* Add in the correct value. */
        x1 = casper_get_word(&p1[NUM_LIMBS - 1]) >> 30;
        x2 = casper_get_word(&p2[NUM_LIMBS - 1]) >> 30;
        index = (x2 | (x1 << 2)) - 2 - (x1 != 0) * 2;

        shiftleft(p1, p1, 2);
        shiftleft(p2, p2, 2);

        copy(Tx, &lut[GETLUTX(index)]);
        copy(Ty, &lut[GETLUTY(index)]);
        copy(Tz, &lut[GETLUTZ(index)]);

        Jac_addition(X3, Y3, Z3, X3, Y3, Z3, Tx, Ty,
                     Tz); //&lut[GETLUTX(index)], &lut[GETLUTY(index)], &lut[GETLUTZ(index)]);
        c += 2;
    }

    /* Special case in the end. */
    if (c == (N_bitlen - 1))
    {
        Jac_double(X3, Y3, Z3, X3, Y3, Z3);
        x1 = casper_get_word(&p1[NUM_LIMBS - 1]) >> 31;
        x2 = casper_get_word(&p2[NUM_LIMBS - 1]) >> 31;
        if (x1)
        {
            Jac_add_affine(X3, Y3, Z3, X3, Y3, Z3, X1, Y1);
        }
        if (x2)
        {
            Jac_add_affine(X3, Y3, Z3, X3, Y3, Z3, X2, Y2);
        }
        c++;
    }

    while (c < N_bitlen)
    {
        Jac_double(X3, Y3, Z3, X3, Y3, Z3);
        c++;
    }
}

#if CASPER_ECC_P256
static void invert_mod_p256(uint32_t *c, uint32_t *a)
{
    int i;
    uint32_t *t, *t2, *s1, *s2, *s4, *s8, *tmp;

    /* Assuming it is safe to use the ECC scratch size. */
    t = &CASPER_MEM[ECC_SCRATCH_START + 2 * CASPER_NUM_LIMBS];
    t2 = &CASPER_MEM[ECC_SCRATCH_START + 3 * CASPER_NUM_LIMBS];
    s1 = &CASPER_MEM[ECC_SCRATCH_START + 4 * CASPER_NUM_LIMBS];
    s2 = &CASPER_MEM[ECC_SCRATCH_START + 5 * CASPER_NUM_LIMBS];
    s4 = &CASPER_MEM[ECC_SCRATCH_START + 6 * CASPER_NUM_LIMBS];
    s8 = &CASPER_MEM[ECC_SCRATCH_START + 7 * CASPER_NUM_LIMBS];
    tmp = &CASPER_MEM[ECC_SCRATCH_START + 8 * CASPER_NUM_LIMBS];

    // t2 = n^(2^1)*n  # 11
    square_casper(tmp, a);
    multiply_casper(t2, tmp, a);

